const AboutUsDesc = () => {
  return (
    <div className="about-us-desc">
      {/* <p className="about-us-desc-title">Մեր Մասին</p> */}

      <p className="about-us-desc-txt">
        Armenian Time հայկական ժամացույցների բրենդը հիմնադրվել է 2020 թվականին և
        գործում է մինչ օրս: Բրենդը զբաղվում է ժամացույցների մոդելավորմամբ,
        դետալների արտադրությամբ ու հավաքմամբ, բրենդավորմամբ և վաճարքով, որի
        արդյունքում հաճախորդներին ներկայացնում է նորաոճ և տարբերվող, շուկայում
        նմանը չունեցող հայակական բրենդիային ժամացույցներ: Բրենդը իր գրանցումը
        անցել է ՀՀ Մտավոր տեփականության գործակալությունում: Գնելով Armenian Time
        բրենդային ժամացույցները հաճախորդները կարող են վստահ լինել, որ գնում են
        իր տեսակում չկրկնվող և նմանը չունեցող մոդելներ, քանի որ բրենդը ենթակա չի
        կրկնօրինակման: Մոդելների գեղեցիկ և յուրօրինակ փաթեթավորումը սպարողին
        տալիս է հնարավորություն ձեռք բերել այն ոչ միայն անձնական օգտագործման
        համար այլ նաև մոդելները կարող է դառնալ Ձեր նվերի լավագույն տարբերակը:
        Մոդելների ցուցադրումը և վաճառքը կատարվում է օնլայն՝ Armenian Time-ի
        պաշտոնական կայքում:
      </p>
    </div>
  );
};

export default AboutUsDesc;
