import { createSlice } from "@reduxjs/toolkit";

const initialState = {
  aboutUsDelivery: [
    {
      id: 1,
      title: "Առաքումը Մարզերում",
      desc: "Առաքումը Մարզերում Մարզերում առաքումը կատարվում է «Հայ փոստ» ընկերության միջոցով 1-3 աշխատանքային օրվա ընթացքում: Վճարումը կատարում եք տեղում՝ հայ փոստի համապատասխան բաժանմունքում, առաքանին ստանալու պահին: Վերադարձը մարզերում Պատվերը չհավանելու և վերադարձնելու դեպքում վերադարձը նույնպես կատարվում է Հայ փոստի միջոցով: Առաքանին հետ ուղարկելուց և մեր ստանալուց հետո մենք Ձեզ օնլայն (քարտային փոխանցում, Idram և այլն) տարբերակով վերադարձնում ապրանքի համար վճարած գումարը: Վերադարձի արժեքը  500 դրամ է:",
    },
    {
      id: 2,
      title: "Առաքումը Մարզերում",
      desc: "Առաքումը Մարզերում Մարզերում առաքումը կատարվում է «Հայ փոստ» ընկերության միջոցով 1-3 աշխատանքային օրվա ընթացքում: Վճարումը կատարում եք տեղում՝ հայ փոստի համապատասխան բաժանմունքում, առաքանին ստանալու պահին: Վերադարձը մարզերում Պատվերը չհավանելու և վերադարձնելու դեպքում վերադարձը նույնպես կատարվում է Հայ փոստի միջոցով: Առաքանին հետ ուղարկելուց և մեր ստանալուց հետո մենք Ձեզ օնլայն (քարտային փոխանցում, Idram և այլն) տարբերակով վերադարձնում ապրանքի համար վճարած գումարը: Վերադարձի արժեքը  500 դրամ է:",
    },
  ],
};

const aboutUsSlice = createSlice({
  name: "aboutUsDelivery",
  initialState,
  reducers: {},
});

export const {} = aboutUsSlice.actions;
export default aboutUsSlice.reducer;
